20250902T215029--kdoc-444-デコード時の未知のキー混入を防ぐ__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:15:40Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 444: デコード時の未知のキー混入を防ぐ</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 444: デコード時の未知のキー混入を防ぐ</h1>
<div id="outline-container-orgbb1e265" class="outline-2">
<h2 id="orgbb1e265"><a href="#orgbb1e265">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgbb1e265">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-10-06 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-10-08 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8753646" class="outline-2">
<h2 id="org8753646"><a href="#org8753646">概要</a></h2>
<div class="outline-text-2" id="text-org8753646">
<p>
JSONやTOMLなどの設定ファイルなどで、未対応のキーが指定されてもエラーを返さない場合、些細だが気づくのに時間を取る問題を発生させることがある。たとえば設定が反映されていないと思ったら大文字だった、など。検証するべきである。
</p>

<p>
少なくとも <code>github.com/BurntSushi/toml</code> には <code>Undecoded()</code> 関数があり、デコード時にデコードされなかった値を検証することで、想定していないキーが指定されたのを検証できる。
</p>

<div class="org-src-container">
<pre class="src src-go">package main

import (
        "fmt"
        "os"

        "github.com/BurntSushi/toml"
)

type Config struct {
        Name string
        Port int
}

func main() {
        var cfg Config
        meta, err := toml.Decode("Name = aaa\nPort = bbb", &amp;cfg)
        if err != nil {
                panic(err)
        }

        // デコードされなかった値をチェックする。あったらエラーにする
        if undecoded := meta.Undecoded(); len(undecoded) &gt; 0 {
                panic(fmt.Errorf("unknown keys found in TOML: %v", undecoded))
        }
        fmt.Printf("Loaded: %+v\n", cfg)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org1c1cb28" class="outline-2">
<h2 id="org1c1cb28"><a href="#org1c1cb28">関連</a></h2>
<div class="outline-text-2" id="text-org1c1cb28">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
